-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Apr 26, 2025 at 05:47 PM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `abecert`
--

-- --------------------------------------------------------

--
-- Table structure for table `groups`
--

CREATE TABLE `groups` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) DEFAULT NULL,
  `title` varchar(255) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `question_weight` int(11) NOT NULL DEFAULT 1,
  `question_count_in_exam` int(11) NOT NULL DEFAULT 8
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `groups`
--

INSERT INTO `groups` (`id`, `name`, `title`, `created_at`, `updated_at`, `question_weight`, `question_count_in_exam`) VALUES
(1, '255', 'დადგენილება №255', NULL, '2025-01-30 09:03:25', 1, 8),
(3, '261', 'დადგენილება №261', NULL, '2025-01-30 09:01:13', 1, 10),
(4, 'garemo', 'გარემო', NULL, '2025-01-30 09:04:46', 1, 2),
(5, 'kanoni', 'კანონი არქიტექტურული საქმიანობის შესახებ', NULL, '2025-01-30 09:06:18', 1, 2),
(6, 'kodexi', 'კოდექსი', NULL, '2025-01-30 09:06:08', 1, 2),
(7, 'konstruqciebi', 'სტრუქტურული სისტემები', NULL, '2025-01-30 09:07:34', 1, 3),
(8, 'sert', 'სერტიფიცირების წესები', NULL, '2025-01-30 09:08:20', 1, 2),
(11, 'masalebi', 'სამშენებლო მასალები და ტექნოლოგიები', '2025-01-30 09:16:59', '2025-01-30 09:16:59', 1, 2),
(12, 'qselebi', 'საინჟინრო სისტემები', '2025-01-30 09:18:35', '2025-01-30 09:18:35', 1, 2),
(13, 'xarjtagricxva', 'შენობის ღირებულების შეფასება', '2025-01-30 09:19:41', '2025-01-30 09:19:41', 1, 2),
(14, '41/1', 'დადგენილება №41. თავი-1', '2025-01-31 01:49:16', '2025-01-31 03:03:45', 1, 2),
(15, '41/3', 'დადგენილება №41. თავი-3', '2025-01-31 01:53:35', '2025-02-13 07:59:54', 1, 3),
(16, '41/4', 'დადგენილება №41. თავი-4', '2025-02-02 04:10:11', '2025-02-13 07:46:40', 1, 4),
(17, '41/5', 'დადგენილება №41. თავი-5', '2025-02-04 05:22:54', '2025-02-13 08:00:17', 1, 3),
(18, '41/6', 'დადგენილება №41. თავი-6', '2025-02-05 13:49:13', '2025-02-05 13:49:13', 1, 2),
(19, '41/7', 'დადგენილება №41. თავი-7', '2025-02-06 05:19:23', '2025-02-13 07:46:17', 1, 4),
(20, '41/8', 'დადგენილება №41. თავი-8', '2025-02-08 18:49:13', '2025-02-13 08:00:54', 1, 1),
(21, '41/9', 'დადგენილება №41. თავი-9', '2025-02-08 18:49:30', '2025-02-13 08:01:05', 1, 4),
(22, '41/10', 'დადგენილება №41. თავი-10', '2025-02-09 15:15:24', '2025-02-13 07:45:41', 1, 6),
(23, '41/11', 'დადგენილება №41. თავი-11', '2025-02-11 07:52:41', '2025-02-13 07:47:14', 1, 4),
(24, '41/12', 'დადგენილება №41. თავი-12', '2025-02-11 10:33:59', '2025-02-11 10:33:59', 1, 2),
(25, '41/14', 'დადგენილება №41. თავი-14', '2025-02-11 11:10:58', '2025-02-11 11:10:58', 1, 2),
(26, '41/15', 'დადგენილება №41. თავი-15', '2025-02-11 13:03:53', '2025-02-11 13:03:53', 1, 2),
(27, '41/16', 'დადგენილება №41. თავი-16', '2025-02-11 14:08:08', '2025-02-11 14:08:08', 1, 2),
(28, '41/17', 'დადგენილება №41. თავი-17', '2025-02-11 14:46:19', '2025-02-13 08:01:53', 1, 3),
(29, '41/18', 'დადგენილება №41. თავი-18', '2025-02-11 15:18:19', '2025-02-13 08:02:08', 1, 1),
(30, '41/19', 'დადგენილება №41. თავი-19', '2025-02-11 15:46:12', '2025-02-11 15:46:12', 1, 2),
(31, '41/20', 'დადგენილება №41. თავი-20', '2025-02-11 16:30:32', '2025-02-13 08:02:58', 1, 1),
(32, '41/21', 'დადგენილება №41. თავი-21', '2025-02-11 17:06:58', '2025-02-11 17:06:58', 1, 2),
(33, '732/1', 'მისაწვდომობის ეროვნული სტანდარტები. თავი-1', '2025-02-14 14:11:35', '2025-02-18 08:11:25', 1, 1),
(34, '732/2/3', 'მისაწვდომობის ეროვნული სტანდარტები. თავი-2/თავი-3', '2025-02-14 14:43:01', '2025-02-14 14:44:36', 1, 2),
(35, '732/4', 'მისაწვდომობის ეროვნული სტანდარტები. თავი-4', '2025-02-14 15:28:09', '2025-02-14 15:28:09', 1, 2),
(36, '732/5', 'მისაწვდომობის ეროვნული სტანდარტები. თავი-5', '2025-02-14 17:42:51', '2025-02-14 17:42:51', 1, 2),
(37, '732/6', 'მისაწვდომობის ეროვნული სტანდარტები. თავი-6', '2025-02-14 18:45:23', '2025-02-14 18:45:23', 1, 2),
(38, '732/7', 'მისაწვდომობის ეროვნული სტანდარტები. თავი-7', '2025-02-16 20:40:57', '2025-02-18 08:11:54', 1, 1),
(39, '732/8', 'მისაწვდომობის ეროვნული სტანდარტები. თავი-8', '2025-02-16 22:05:58', '2025-02-18 08:12:09', 1, 1),
(40, '732/9', 'მისაწვდომობის ეროვნული სტანდარტები. თავი-9', '2025-02-16 23:45:49', '2025-02-18 08:12:23', 1, 1),
(41, '732/10', 'მისაწვდომობის ეროვნული სტანდარტები. თავი-10', '2025-02-18 17:10:24', '2025-02-18 17:10:24', 1, 1),
(42, '732/11', 'მისაწვდომობის ეროვნული სტანდარტები. თავი-11', '2025-02-18 18:46:37', '2025-02-18 18:46:37', 1, 2);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `groups`
--
ALTER TABLE `groups`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `groups`
--
ALTER TABLE `groups`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=43;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
